ShallowGreen123/ESP32P4/mipi_dsi_lvgl8/sdkconfig.defaults

# # This file was generated using idf.py save-defconfig. It can be edited manually.
# # Espressif IoT Development Framework (ESP-IDF) 5.3.0 Project Minimal Configuration
# #
# CONFIG_IDF_TARGET="esp32p4"
# #
# # Serial flasher config
# #
# CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
# CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# #
# # Partition Table
# #
# CONFIG_PARTITION_TABLE_CUSTOM=y
# CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
# CONFIG_PARTITION_TABLE_OFFSET=0x9000
# #
# # ESP PSRAM
# #
# CONFIG_SPIRAM=y
# CONFIG_SPIRAM_SPEED_200M=y
# CONFIG_SPIRAM_XIP_FROM_PSRAM=y
# #
# # Cache config
# #
# CONFIG_CACHE_L2_CACHE_256KB=y
# CONFIG_CACHE_L2_CACHE_LINE_128B=y
# #
# # Memory protection
# #
# CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
# #
# # FreeRTOS
# #
# CONFIG_FREERTOS_HZ=1000
# CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
# CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
# # 
# # LVGL
# # 
# CONFIG_LV_MEM_CUSTOM=y



# #######################################################

CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_ORPHAN_SECTIONS_WARNING=y
# CONFIG_ESP32P4_REV_MIN_0=y
CONFIG_SPIRAM=y
# CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
# CONFIG_CACHE_L2_CACHE_256KB=y
# CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
# CONFIG_BSP_BOARD_TYPE_FIB=y
# CONFIG_BSP_LCD_CONTROLLER_EK79007=y
# CONFIG_BSP_DISPLAY_LVGL_VERSION_V8=y
# CONFIG_BSP_DISPLAY_LVGL_TASK_PRIORITY=5
# CONFIG_BSP_DISPLAY_LVGL_TASK_STACK_SIZE_KB=10
# CONFIG_BSP_DISPLAY_LVGL_BUF_HEIGHT=600
CONFIG_LV_COLOR_SCREEN_TRANSP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_DISP_DEF_REFR_PERIOD=15
CONFIG_LV_CIRCLE_CACHE_SIZE=10
CONFIG_LV_LAYER_SIMPLE_BUF_SIZE=102400
CONFIG_LV_IMG_CACHE_DEF_SIZE=5
CONFIG_LV_GRAD_CACHE_DEF_SIZE=10240
CONFIG_LV_USE_PERF_MONITOR=y
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_FONT_MONTSERRAT_8=y
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_30=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_34=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_38=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_42=y
CONFIG_LV_FONT_MONTSERRAT_44=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_USE_DEMO_WIDGETS=y
CONFIG_LV_USE_DEMO_BENCHMARK=y
CONFIG_LV_USE_DEMO_STRESS=y
CONFIG_LV_USE_DEMO_MUSIC=y
CONFIG_LV_DEMO_MUSIC_AUTO_PLAY=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

